灰diff
 - 愚直解
 - 全探索、二分探索
 - 貪欲法
茶diff
 - 分解、組み合わせ、抽象化、一般化、シミュレーション
 - 一方を固定する、向きを固定する、差分だけ計算する、逆順にやる、反対方向からやる
 - 深さ優先探索、幅優先探索、bit全探索、順列全探索
 - 累積和、imos法、しゃくとり法
 - DP
 - 算数、場合の数、確率、期待値、中央値、二項係数、三角関数、XOR
 - 約数、倍数、最大公約数、最小公倍数、素数、余り、合同式
 - 集合、余事象、包除原理
 - queue、stack、set、map
 - グラフ、UnionFind
緑diff
 - 文字列DP(LCS)
 - 鳩の巣原理、主客転倒
 - 枝刈り全探索、付近全探索
 - ダイクストラ法、ワーシャルフロイド法
 - セグメント木、ダブリング
 - 最小全域木
水diff
 - 半分全列挙、平面走査、三分探索、拡張ユークリッドの互除法
 - ナップザックDP、bitDP、桁DP、区間DP、期待値DP、確率DP、木DP
 - ベルマンフォード法
 - 最長増加部分列(LIS)
 - BIT
青diff
 - 最小共通祖先(LCA)、オイラーツアー
 - 遅延セグメント木、Segment Tree Beats
